test/cassettes/quotation.yml

---
http_interactions:
- request:
    method: post
    uri: "{VERTEX_SOAP_API}"
    body:
      encoding: UTF-8
      string: '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:urn="urn:vertexinc:o-series:tps:7:0"
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><urn:VertexEnvelope><Login><TrustedId>{VERTEX_TRUSTED_ID}</TrustedId></Login><QuotationRequest
        transactionType="SALE"><LineItem lineItemNumber="1" taxDate="2018-11-15"><Customer><Destination><StreetAddress1>11
        Wall Street</StreetAddress1><City>New York</City><MainDivision>NY</MainDivision><PostalCode>10005</PostalCode></Destination></Customer><Seller><Company>CustomInk</Company></Seller><Product
        productClass="53103000">4600</Product><Quantity>7</Quantity><ExtendedPrice>35.50</ExtendedPrice></LineItem><LineItem
        lineItemNumber="2" taxDate="2018-11-14"><Customer><Destination><StreetAddress1>2910
        District Ave #300</StreetAddress1><City>Fairfax</City><MainDivision>VA</MainDivision><PostalCode>22031</PostalCode></Destination></Customer><Seller><Company>CustomInk</Company></Seller><Product
        productClass="53103000">5300</Product><Quantity>4</Quantity><ExtendedPrice>25.40</ExtendedPrice></LineItem></QuotationRequest></urn:VertexEnvelope></soapenv:Body></soapenv:Envelope>'
    headers:
      Soapaction:
      - '"VertexEnvelope"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1242'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: ''
    headers:
      Date:
      - Thu, 29 Nov 2018 19:32:08 GMT
      Content-Type:
      - text/xml;charset=UTF-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Vary:
      - Accept-Encoding
      Soapaction:
      - '""'
      Server:
      - ''
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header></soapenv:Header><soapenv:Body><VertexEnvelope xmlns="urn:vertexinc:o-series:tps:7:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><Login><TrustedId></TrustedId>
        </Login>
        <QuotationResponse documentDate="2018-11-29" transactionType="SALE"><SubTotal>60.9</SubTotal>
        <Total>62.42</Total>
        <TotalTax>1.52</TotalTax>
        <LineItem lineItemNumber="1" taxDate="2018-11-15"><Seller><Company>CustomInk</Company>
        </Seller>
        <Customer><Destination taxAreaId="330612010"><StreetAddress1>11 Wall Street</StreetAddress1>
        <City>New York</City>
        <MainDivision>NY</MainDivision>
        <PostalCode>10005</PostalCode>
        </Destination>
        </Customer>
        <Product productClass="53103000">4600</Product>
        <Quantity>7.0</Quantity>
        <FairMarketValue>35.5</FairMarketValue>
        <ExtendedPrice>35.5</ExtendedPrice>
        <Taxes taxResult="NO_TAX" taxType="SALES" situs="DESTINATION" notRegisteredIndicator="true" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="24354">NEW YORK</Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1">Sales and Compensating Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <Taxes taxResult="NO_TAX" taxType="SALES" situs="DESTINATION" notRegisteredIndicator="true" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="CITY" jurisdictionId="25353">NEW YORK</Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1">Local Sales and Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <Taxes taxResult="NO_TAX" taxType="SALES" situs="DESTINATION" notRegisteredIndicator="true" taxCollectedFromParty="BUYER"><Jurisdiction jurisdictionLevel="DISTRICT" jurisdictionId="79774"><![CDATA[METROPOLITAN COMMUTER TRANSPORTATION DISTRICT]]></Jurisdiction>
        <CalculatedTax>0.0</CalculatedTax>
        <EffectiveRate>0.0</EffectiveRate>
        <Taxable>0.0</Taxable>
        <Imposition impositionId="1"><![CDATA[Metropolitan Commuter Transportation District]]></Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        </Taxes>
        <TotalTax>0.0</TotalTax>
        </LineItem>
        <LineItem lineItemNumber="2" taxDate="2018-11-14"><Seller><Company>CustomInk</Company>
        </Seller>
        <Customer><Destination taxAreaId="470590000"><StreetAddress1>2910 District Ave #300</StreetAddress1>
        <City>Fairfax</City>
        <MainDivision>VA</MainDivision>
        <PostalCode>22031</PostalCode>
        </Destination>
        </Customer>
        <Product productClass="53103000">5300</Product>
        <Quantity>4.0</Quantity>
        <FairMarketValue>25.4</FairMarketValue>
        <ExtendedPrice>25.4</ExtendedPrice>
        <Taxes taxResult="TAXABLE" taxType="SALES" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="STATE" jurisdictionId="39067">VIRGINIA</Jurisdiction>
        <CalculatedTax>1.09</CalculatedTax>
        <EffectiveRate>0.043</EffectiveRate>
        <Taxable>25.4</Taxable>
        <Imposition impositionId="1">Retail Sales and Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        <TaxRuleId>510815</TaxRuleId>
        </Taxes>
        <Taxes taxResult="TAXABLE" taxType="SALES" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="COUNTY" jurisdictionId="39378">FAIRFAX</Jurisdiction>
        <CalculatedTax>0.25</CalculatedTax>
        <EffectiveRate>0.01</EffectiveRate>
        <Taxable>25.4</Taxable>
        <Imposition impositionId="1">Local Sales and Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        <TaxRuleId>23410</TaxRuleId>
        </Taxes>
        <Taxes taxResult="TAXABLE" taxType="SALES" situs="DESTINATION" taxCollectedFromParty="BUYER" taxStructure="SINGLE_RATE"><Jurisdiction jurisdictionLevel="DISTRICT" jurisdictionId="97100">REGIONAL TRANSPORTATION DISTRICT</Jurisdiction>
        <CalculatedTax>0.18</CalculatedTax>
        <EffectiveRate>0.007</EffectiveRate>
        <Taxable>25.4</Taxable>
        <Imposition impositionId="1">Local Sales and Use Tax</Imposition>
        <ImpositionType impositionTypeId="1">General Sales and Use Tax</ImpositionType>
        <TaxRuleId>510824</TaxRuleId>
        </Taxes>
        <TotalTax>1.52</TotalTax>
        </LineItem>
        </QuotationResponse>
        <ApplicationData><ResponseTimeMS>47.2</ResponseTimeMS>
        </ApplicationData>
        </VertexEnvelope></soapenv:Body></soapenv:Envelope>
    http_version: 
  recorded_at: Thu, 29 Nov 2018 19:32:08 GMT
recorded_with: VCR 4.0.0
